#+TITLE: Data transfer overhead and latency profiling
#+STARTUP: latexpreview

*** Runs
|      | Cuda event time memcpy (ms) | Profiler time H2D (ms) | CPU execution time (s) |
|------+-----------------------------+------------------------+------------------------|
|    1 |                     1.10461 |                1.06172 |                7.02166 |
|    2 |                     1.10214 |                 1.0586 |            7.202221227 |
|    3 |                     1.14467 |                 1.1010 |            6.840616962 |
|------+-----------------------------+------------------------+------------------------|
| Mean |                     1.11714 |              1.0737733 |              7.0214994 |
#+TBLFM: @5$4=vmean(@2$4..@4$4)::@5$3=vmean(@2$3..@4$3)::@5$2=vmean(@2$2..@4$2)

*** Runs
|      | Cuda event time memcpy (ms) | Profiler time H2D (ms) | CPU execution time (s) |
|------+-----------------------------+------------------------+------------------------|
|    1 |                     2.32048 |                 2.2745 |                52.1475 |
|    2 |                     2.32906 |                 2.2794 |             53.2673507 |
|    3 |                      2.3192 |                 2.2740 |             52.4127731 |
|------+-----------------------------+------------------------+------------------------|
| Mean |                   2.3229133 |              2.2759667 |              52.609208 |
#+TBLFM: @5$4=vmean(@2$4..@4$4)::@5$3=vmean(@2$3..@4$3)::@5$2=vmean(@2$2..@4$2)

*** Runs
|      | Cuda event time memcpy (ms) | Profiler time H2D (ms) | CPU execution time (s) |
|------+-----------------------------+------------------------+------------------------|
|    1 |                     4.44154 |                 4.3965 |                597.880 |
|    2 |                      4.4455 |                 4.4014 |            395.8547549 |
|    3 |                      4.4399 |                 4.3936 |            576.6556793 |
|------+-----------------------------+------------------------+------------------------|
| Mean |                   4.4423133 |              4.3971667 |              523.46348 |
#+TBLFM: @5$4=vmean(@2$4..@4$4)::@5$3=vmean(@2$3..@4$3)::@5$2=vmean(@2$2..@4$2)

*** Runs
|      | Cuda event time memcpy (ms) | Profiler time H2D (ms) | CPU execution time (s) |
|------+-----------------------------+------------------------+------------------------|
|    1 |                     5.22499 |                 5.1811 |               1618.210 |
|    2 |                     5.24016 |                 5.1962 |            1642.962911 |
|    3 |                        5.34 |                 5.2941 |            1626.662194 |
|------+-----------------------------+------------------------+------------------------|
| Mean |                   5.2683833 |                 5.2238 |              1629.2784 |
#+TBLFM: @5$4=vmean(@2$4..@4$4)::@5$3=vmean(@2$3..@4$3)::@5$2=vmean(@2$2..@4$2)

*** Runs
|      | Cuda event time memcpy (ms) | Profiler time H2D (ms) | CPU execution time (s) |
|------+-----------------------------+------------------------+------------------------|
|    1 |                     13.8953 |                 13.851 |               5300.290 |
|    2 |                     13.8866 |                 13.838 |            5263.634601 |
|    3 |                     13.8023 |                 13.756 |             5136.96921 |
|------+-----------------------------+------------------------+------------------------|
| Mean |                     13.8614 |                 13.815 |              5233.6313 |
#+TBLFM: @5$4=vmean(@2$4..@4$4)::@5$3=vmean(@2$3..@4$3)::@5$2=vmean(@2$2..@4$2)

*** Runs
|      | Cuda event time memcpy (ms) | Profiler time H2D (ms) | CPU execution time (s) |
|------+-----------------------------+------------------------+------------------------|
|    1 |                     26.3756 |                 26.331 |               2410.220 |
|    2 |                      26.504 |                 26.458 |            2402.413644 |
|    3 |                             |                        |                        |
|------+-----------------------------+------------------------+------------------------|
| Mean |                     26.4398 |                26.3945 |              2406.3168 |
#+TBLFM: @5$4=vmean(@2$4..@4$4)::@5$3=vmean(@2$3..@4$3)::@5$2=vmean(@2$2..@4$2)


** H2D data transfer analysis

CUDA event time includes both CPU overhead as well as PCIe transfer latency, while the profiler time includes only the latency at the GPU side (PCIe only). Hence profiler time can be considered as latency and CUDA event time as latency + overhead.

| Experiment     | Data sent (MB) | CUDA event time (ms) (L + o) | Profiler time (ms) (L) |    overhead (o) (ms) | Latency / Byte (ps) | PCIe throughput (GB/s) |
|----------------+----------------+------------------------------+------------------------+----------------------+---------------------+------------------------|
| Default config |         13.849 |                      1.11714 |              1.0737733 |  0.04336669999999998 |   77.53435627121092 |      12.89750825430284 |
| config 1       |         29.794 |                    2.3229133 |              2.2759667 |  0.04694660000000006 |   76.39010203396657 |     13.090701195232777 |
| config 2       |         57.737 |                    4.4423133 |              4.3971667 |   0.0451466000000007 |   76.15855863657619 |     13.130500601671528 |
| config 3       |         67.977 |                    5.2683833 |                 5.2238 | 0.044583300000000214 |   76.84658046103829 |     13.012940771086184 |
| config 4       |        180.617 |                      13.8614 |                 13.815 |  0.04640000000000022 |   76.48781676143442 |     13.073977560622511 |
| config 5       |        344.457 |                      26.4398 |                26.3945 | 0.045300000000001006 |   76.62640039250182 |     13.050332455625224 |
|----------------+----------------+------------------------------+------------------------+----------------------+---------------------+------------------------|
| Mean           |                |                              |                        |          0.045290533 |           76.673969 |              13.042660 |
#+TBLFM: $5='(- $3 $4);N::$6='(/ (* $4 1000) $2);N::$7='(/ $2 $4);N::@8$5=vmean(@2$5..@7$5)::@8$6=vmean(@2$6..@7$6)::@8$7=vmean(@2$7..@7$7)

** CPU execution times

| Experiment     | Data processed (B) (g) | CPU execution time (s) (t) |                ps |        t/g (ns/B)  |
|----------------+------------------------+----------------------------+-------------------+--------------------|
| Default config |               13848576 |                  7.0214994 |   7021499400000.0 |  507.0195953721162 |
| config 1       |               29794304 |                  52.609208 |  52609208000000.0 | 1765.7471710028872 |
| config 2       |               57737216 |                  523.46348 | 523463480000000.0 |  9066.309674508726 |
| config 3       |               67977216 |                  1629.2784 |     1.6292784e+15 |  23968.00716287057 |
| config 4       |              180617216 |                  5233.6313 |     5.2336313e+15 | 28976.370115238627 |
#+TBLFM: $4='(* $3 1e+12);N::$5='(* (/ $3 $2) 1e+9);N

Power regression analysis: $t = 3.645632e-7 * g^{2.7143}$

$\beta = 2.7143$

